Subrat48/Flash_Read_and_Write_STM32_OBC_S2S2_Bare_Metal_Dummy/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MAIN_FM_CS_Pin GPIO_PIN_3
#define MAIN_FM_CS_GPIO_Port GPIOD
#define EN_GLOBAL_RESET_Pin GPIO_PIN_10
#define EN_GLOBAL_RESET_GPIO_Port GPIOI
#define DEBUG_TX_OBC_Pin GPIO_PIN_8
#define DEBUG_TX_OBC_GPIO_Port GPIOE
#define CS_MAG_Pin GPIO_PIN_9
#define CS_MAG_GPIO_Port GPIOD
#define IMU_MOSI_Pin GPIO_PIN_15
#define IMU_MOSI_GPIO_Port GPIOB
#define ADC1_CS_Pin GPIO_PIN_4
#define ADC1_CS_GPIO_Port GPIOH
#define BAT_MON_ADC_Pin GPIO_PIN_5
#define BAT_MON_ADC_GPIO_Port GPIOA
#define ADC_MOSI_Pin GPIO_PIN_11
#define ADC_MOSI_GPIO_Port GPIOF
#define ADC_MISO_Pin GPIO_PIN_7
#define ADC_MISO_GPIO_Port GPIOH
#define IMU_SCK_Pin GPIO_PIN_13
#define IMU_SCK_GPIO_Port GPIOB
#define IMU_MISO_Pin GPIO_PIN_14
#define IMU_MISO_GPIO_Port GPIOB
#define DEBUG_RX_OBC_Pin GPIO_PIN_7
#define DEBUG_RX_OBC_GPIO_Port GPIOE
#define ADC_SCK_Pin GPIO_PIN_6
#define ADC_SCK_GPIO_Port GPIOH
#define CS_MPU_Pin GPIO_PIN_10
#define CS_MPU_GPIO_Port GPIOH

/* USER CODE BEGIN Private defines */
#define CS_SEL	0
#define CS_DES	1

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
